In [1]:
import pandas as pd
from pathlib import Path

In [7]:
data = Path(r'C:\Users\TribThapa\Desktop\Thapa\ResearchFellow\Courses\FinTech_Bootcamp_MonashUni2021\monu-mel-virt-fin-pt-05-2021-u-c\Activities\Week 3\2\04-Ins_Data_Cleaning\Resources\order_data.csv')

data_df = pd.read_csv(data, index_col='order_no')
                     
data_df.head(20)

           customer_no order_total  order_date
order_no
452517125     CM458565     $141.25  01-10-2019
45251825      CJ458565       14.00  04/25/2019
4465241327     AK45765    $1103.36  04-25-2019
4465241327     AK45765    $1103.36  04-25-2019
413853121     CM458565         NaN   4/24/2019
45235825        TV4663       65.42  04-29-2019
2356363           2124   258936.12  04-29-2019
452519232          NaN     $141.25  01-10-2019

In [14]:
data_df.sample(5) #print random sample

           customer_no order_total  order_date
order_no
4465241327     AK45765    $1103.36  04-25-2019
452519232          NaN     $141.25  01-10-2019
2356363           2124   258936.12  04-29-2019
45251825      CJ458565       14.00  04/25/2019
452517125     CM458565     $141.25  01-10-2019

In [12]:
data_df.dtypes

customer_no    object
order_total    object
order_date     object
dtype: object

In [15]:
data_df.count()

customer_no    7
order_total    7
order_date     8
dtype: int64

In [17]:
data_df['customer_no'].value_counts()

CM458565    2
AK45765     2
TV4663      1
CJ458565    1
2124        1
Name: customer_no, dtype: int64

In [18]:
data_df.isnull()

            customer_no  order_total  order_date
order_no
452517125         False        False       False
45251825          False        False       False
4465241327        False        False       False
4465241327        False        False       False
413853121         False         True       False
45235825          False        False       False
2356363           False        False       False
452519232          True        False       False

In [19]:
data_df.isnull().mean() * 100

customer_no    12.5
order_total    12.5
order_date      0.0
dtype: float64

In [20]:
data_df.isnull().sum()

customer_no    1
order_total    1
order_date     0
dtype: int64

In [21]:
data_df['customer_no'] = data_df['customer_no'].fillna('Unknown')
data_df

           customer_no order_total  order_date
order_no
452517125     CM458565     $141.25  01-10-2019
45251825      CJ458565       14.00  04/25/2019
4465241327     AK45765    $1103.36  04-25-2019
4465241327     AK45765    $1103.36  04-25-2019
413853121     CM458565         NaN   4/24/2019
45235825        TV4663       65.42  04-29-2019
2356363           2124   258936.12  04-29-2019
452519232      Unknown     $141.25  01-10-2019

In [22]:
data_df = data_df.dropna().copy()
data_df

           customer_no order_total  order_date
order_no
452517125     CM458565     $141.25  01-10-2019
45251825      CJ458565       14.00  04/25/2019
4465241327     AK45765    $1103.36  04-25-2019
4465241327     AK45765    $1103.36  04-25-2019
45235825        TV4663       65.42  04-29-2019
2356363           2124   258936.12  04-29-2019
452519232      Unknown     $141.25  01-10-2019

In [23]:
data_df.isnull().sum()

customer_no    0
order_total    0
order_date     0
dtype: int64

In [24]:
data_df.duplicated()

order_no
452517125     False
45251825      False
4465241327    False
4465241327     True
45235825      False
2356363       False
452519232     False
dtype: bool

In [26]:
data_df['customer_no'].duplicated()

order_no
452517125     False
45251825      False
4465241327    False
4465241327     True
45235825      False
2356363       False
452519232     False
Name: customer_no, dtype: bool

In [31]:
data_df = data_df.drop_duplicates().copy()
data_df['customer_no'].duplicated()

order_no
452517125     False
45251825      False
4465241327    False
45235825      False
2356363       False
452519232     False
Name: customer_no, dtype: bool

In [33]:
data_df.head(20)

           customer_no order_total  order_date
order_no
452517125     CM458565     $141.25  01-10-2019
45251825      CJ458565       14.00  04/25/2019
4465241327     AK45765    $1103.36  04-25-2019
45235825        TV4663       65.42  04-29-2019
2356363           2124   258936.12  04-29-2019
452519232      Unknown     $141.25  01-10-2019

In [34]:
data_df['order_total'] = data_df['order_total'].str.replace("$", "")
data_df['order_total']

C:\Users\TribThapa\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will*not* be treated as literal strings when regex=True.
  """Entry point for launching an IPython kernel.

order_no
452517125        141.25
45251825          14.00
4465241327      1103.36
45235825          65.42
2356363       258936.12
452519232        141.25
Name: order_total, dtype: object

In [35]:
data_df.dtypes

customer_no    object
order_total    object
order_date     object
dtype: object

In [37]:
data_df['order_total'] = data_df['order_total'].astype('float')
data_df.dtypes

customer_no     object
order_total    float64
order_date      object
dtype: object